In [1]:
test=lambda x:x**2
print(test(5))

25

In [2]:
add=lambda x,y:x+y

In [4]:
print(add(5,7))

12

In [8]:
sub=lambda x,y:x^y

In [9]:
print(sub(2,3))

1

In [10]:
muti=lambda x,y:x*y

In [11]:
print(muti(3,3))

9

In [12]:
div=lambda x,y:x/y

In [13]:
print(div(5,5))

1.0

In [25]:
import pandas as pd

In [20]:
df={"name":["shruti","bhagya"],
    "age":[21,22]
   }

In [21]:
df=pd.DataFrame(df)

In [23]:
df["newage"]=df["age"].apply(lambda x:x+5)

In [24]:
print(df)

     name  age  newage
0  shruti   21      26
1  bhagya   22      27

In [32]:
import pandas as pd

In [35]:
df=pd.read_csv("Employee_Salary_Dataset.csv")

In [36]:
df

    ID  Experience_Years  Age  Gender    Salary
0    1                 5   28  Female    250000
1    2                 1   21    Male     50000
2    3                 3   23    male    170000
3    4                 2   22    Male     25000
4    5                 1   17    Male     10000
5    6                25   62    Male   5001000
6    7                19   54  Female    800000
7    8                 2   21  Female      9000
8    9                10   36  Female     61500
9   10                15   54  Female    650000
10  11                 4   26  Female    250000
11  12                 6   29    Male   1400000
12  13                14   39    Male   6000050
13  14                11   40    Male    220100
14  15                 2   23    Male      7500
15  16                 4   27  Female     87000
16  17                10   34  Female    930000
17  18                15   54  Female   7900000
18  19                 2   21    Male     15000
19  20                10   36    Male    330000
20  21                15   54    Male   6570000
21  22                 4   26    Male     25000
22  23                 5   29    Male   6845000
23  24                 1   21  Female      6000
24  25                 4   23  Female      8900
25  26                 3   22  Female     20000
26  27                 1   18    Male      3000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
30  31                10   34    Male     80000
31  32                15   54    Male    900000
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
34  35                16   49    Male   7600000

In [1]:
num=lambda a:"positive"if a>0 else "negitive"

In [2]:
(num(7))

'positive'

In [3]:
nums=[2,3,4,5]

In [4]:
cubes=list(map(lambda x:x**3,nums))

In [5]:
cubes

[8, 27, 64, 125]

In [6]:
num=[1,21]

In [5]:
divisible=list(filter(lambda x:x%3==0(range(1,21)))

_IncompleteInputError: incomplete input (4203746630.py, line 1)

In [6]:
divisible

NameError: name 'divisible' is not defined

In [11]:
import numpy as np

In [12]:
A=np.array([2,6,7,9,5])

In [13]:
B=np.array([2,5,8,6,1])

In [16]:
comman=np.intersect1d(A,B)

In [17]:
print(comman)

[2 5 6]

In [18]:
only_A=np.setdiff1d(A,B)

In [19]:
only_A

array([7, 9])

In [22]:
only_B=np.setdiff1d(B,A)

In [23]:
only_B

array([1, 8])

In [24]:
import pandas as pd

In [25]:
import numpy as np

In [26]:
data={"name":["amit","sumit","kiran"],
      "sale":[[200,300,400,500],[100,200,300,400],[300,400,500,600]]
     }

In [29]:
df=pd.DataFrame(data)

In [32]:
df

    name                  sale  avg_sales  total
0   amit  [200, 300, 400, 500]      350.0   1400
1  sumit  [100, 200, 300, 400]      250.0   1000
2  kiran  [300, 400, 500, 600]      450.0   1800

In [30]:
df["avg_sales"]=df["sale"].apply(lambda x:np.mean(x))

In [31]:
df["total"]=df["sale"].apply(sum)

In [33]:
high_perfomer=df[df["total"]>1000]

In [34]:
df

    name                  sale  avg_sales  total
0   amit  [200, 300, 400, 500]      350.0   1400
1  sumit  [100, 200, 300, 400]      250.0   1000
2  kiran  [300, 400, 500, 600]      450.0   1800

In [35]:
(high_perfomer)

    name                  sale  avg_sales  total
0   amit  [200, 300, 400, 500]      350.0   1400
2  kiran  [300, 400, 500, 600]      450.0   1800

In [5]:
dic={"name":["mango","milk","faluda","lassi"],
     "MRP":[[20,60,89,56],[10,20,30,40],[20,89,65,45],[35,56,65,34]]
    }

In [6]:
df=pd.DataFrame(dic)

NameError: name 'pd' is not defined

In [38]:
df

     name               MRP
0   mango  [20, 60, 89, 56]
1    milk  [10, 20, 30, 40]
2  faluda  [20, 89, 65, 45]
3   lassi  [35, 56, 65, 34]

In [3]:
df["%Change"] = df["MRP"].apply(lambda x: ((np.array(x)[-1] - np.array(x)[0]) / np.array(x)[0]) * 100 )
df["Avg_MRP"] = df["MRP"].apply(np.mean)
a=df[df["Avg_MRP"]>30]

NameError: name 'df' is not defined

In [8]:
import pandas as pd

In [9]:
dic={"name":["mango","milk","faluda","lassi"],
     "MRP":[[20,60,89,56],[10,20,30,40],[20,89,65,45],[35,56,65,34]]
    }

In [10]:
df=pd.DataFrame(dic)

In [11]:
df

     name               MRP
0   mango  [20, 60, 89, 56]
1    milk  [10, 20, 30, 40]
2  faluda  [20, 89, 65, 45]
3   lassi  [35, 56, 65, 34]

In [13]:
import numpy as np

In [14]:
df["%Change"] = df["MRP"].apply(lambda x: ((np.array(x)[-1] - np.array(x)[0]) / np.array(x)[0]) * 100 )
df["Avg_MRP"] = df["MRP"].apply(np.mean)
a=df[df["Avg_MRP"]>30]

In [15]:
a

     name               MRP     %Change  Avg_MRP
0   mango  [20, 60, 89, 56]  180.000000    56.25
2  faluda  [20, 89, 65, 45]  125.000000    54.75
3   lassi  [35, 56, 65, 34]   -2.857143    47.50

In [16]:
import pandas as pd

In [17]:
import numpy as np

In [18]:
dic={"name":["bhagyashri","struti","ovee","pritiksha"],
     "salary":[4000,6000,7500,30000]
    }

In [19]:
df=pd.DataFrame(dic)

In [20]:
df

         name  salary
0  bhagyashri    4000
1      struti    6000
2        ovee    7500
3   pritiksha   30000

In [36]:
tax=np.where (df['salary']>=50000,df['salary']*0.1,df['salary']*0.05)

In [37]:
tax

array([ 200.,  300.,  375., 1500.])

In [33]:
df["bonces"]=[100,200,300,400]

In [66]:
df

     name  score result grade
0    teju     60   pass     A
1  bhagya     20   fali     C
2    ritu     34   pass     F
3  shewta     15   fali     B

In [41]:
stu={"name":["teju","bhagya","ritu","shewta"],
      "score":[60,20,34,15]
     }

In [42]:
df=pd.DataFrame(stu)

In [43]:
df

     name  score
0    teju     60
1  bhagya     20
2    ritu     34
3  shewta     15

In [58]:
result=np.where( df['score']>25 ,"pass","fali")

In [60]:
df["result"]=result

In [61]:
df

     name  score result
0    teju     60   pass
1  bhagya     20   fali
2    ritu     34   pass
3  shewta     15   fali

In [62]:
df["grade"]=["A","C","F","B"]

In [63]:
df

     name  score result grade
0    teju     60   pass     A
1  bhagya     20   fali     C
2    ritu     34   pass     F
3  shewta     15   fali     B

In [10]:
import pandas as pd

In [11]:
import numpy as np

In [12]:
att={"name":["bhagya","ovee","gatha"],
     "attandance":["56","67","89"]
    }

In [13]:
df=pd.DataFrame(att)

In [14]:
df

     name attandance
0  bhagya         56
1    ovee         67
2   gatha         89

In [20]:
eligible=np.where(df["attandance"]>="75%" ,"yes","no")

In [22]:
df["eligible"]=eligible

In [23]:
df

     name attandance eligible
0  bhagya         56       no
1    ovee         67       no
2   gatha         89      yes

In [24]:
import pandas as pd

In [25]:
city={"name":["loni","kolhar","c.sambhaginager","kokan"],
      "temp":["45c","67c","34c","78c"]
     }

In [26]:
df=pd.DataFrame(city)

In [27]:
df

              name temp
0             loni  45c
1           kolhar  67c
2  c.sambhaginager  34c
3            kokan  78c

In [36]:
data = pd.read_csv("home.csv")

In [34]:
df

              name temp
0             loni  45c
1           kolhar  67c
2  c.sambhaginager  34c
3            kokan  78c

In [37]:
import numpy as pd

In [42]:
df["Humandity"]=["23","78","78","23"]

In [43]:
df

              name temp Humandity
0             loni  45c        23
1           kolhar  67c        78
2  c.sambhaginager  34c        78
3            kokan  78c        23

In [47]:
alter=np.where(df["Humandity"]>"50" ,"red","green")

In [50]:
df["alter"]=alter

In [51]:
df

              name temp Humandity  green  red  alter
0             loni  45c        23  green  red  green
1           kolhar  67c        78  green  red    red
2  c.sambhaginager  34c        78  green  red    red
3            kokan  78c        23  green  red  green

In [83]:
import pandas as pd

In [84]:
unice={"name":["ojasvi","gatha","katha","gauri","manda","kanta","shanta","shalu"],
       "math":np.random.randint(20,100,size=8),
    "english":np.random.randint(15,100,size=8),
    "science":np.random.randint(9,100,size=8)
      }

In [85]:
df=pd.DataFrame(unice)

In [86]:
df

     name  math  english  science
0  ojasvi    50       25       56
1   gatha    97       50       92
2   katha    21       78       16
3   gauri    88       97       72
4   manda    45       74       63
5   kanta    99       20       55
6  shanta    51       51       47
7   shalu    47       90       61

In [87]:
import numpy as np

In [88]:
average= df[["math", "science", "english"]].mean(axis=1)

In [89]:
df["average"]= average

In [90]:
df

     name  math  english  science    average
0  ojasvi    50       25       56  43.666667
1   gatha    97       50       92  79.666667
2   katha    21       78       16  38.333333
3   gauri    88       97       72  85.666667
4   manda    45       74       63  60.666667
5   kanta    99       20       55  58.000000
6  shanta    51       51       47  49.666667
7   shalu    47       90       61  66.000000

In [94]:
performance= np.where(df["average"] >= 80, "Excellent",np.where(df["average"] >= 50, "Good", "Poor"))

In [96]:
df["performance"]=performance

In [97]:
df

     name  math  english  science    average performance
0  ojasvi    50       25       56  43.666667        Poor
1   gatha    97       50       92  79.666667        Good
2   katha    21       78       16  38.333333        Poor
3   gauri    88       97       72  85.666667   Excellent
4   manda    45       74       63  60.666667        Good
5   kanta    99       20       55  58.000000        Good
6  shanta    51       51       47  49.666667        Poor
7   shalu    47       90       61  66.000000        Good

In [101]:
import pandas as pd

In [115]:
product={"name":["milk","faluda","mastani","ice-creme","lassi","momos"],
 "saling price":["400","600","234","567","980","1000"],
   "cost price":["670","345","345","543","435","456"]
        }

In [116]:
df=pd.DataFrame(product)

In [117]:
df.to_csv("bhagya.csv" , index=False)

In [118]:
df

        name saling price cost price
0       milk          400        670
1     faluda          600        345
2    mastani          234        345
3  ice-creme          567        543
4      lassi          980        435
5      momos         1000        456

In [1]:
!pip install matplotlib

Collecting matplotlib
  Downloading matplotlib-3.10.5-cp313-cp313-win_amd64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.3-cp313-cp313-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.59.1-cp313-cp313-win_amd64.whl.metadata (111 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.9-cp313-cp313-win_amd64.whl.metadata (6.4 kB)
Requirement already satisfied: numpy>=1.23 in c:\users\bhagyashri jadhav\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (2.3.2)
Requirement already satisfied: packaging>=20.0 in c:\users\bhagyashri jadhav\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (25.0)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-11.3.0-cp313-cp313-win_amd64.whl.metadata (9.2 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Downloading pyparsing-3.2.3-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\bhagyashri jadhav\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\bhagyashri jadhav\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.10.5-cp313-cp313-win_amd64.whl (8.1 MB)
   ---------------------------------------- 0.0/8.1 MB ? eta -:--:--
   --- ------------------------------------ 0.8/8.1 MB 3.3 MB/s eta 0:00:03
   ------- -------------------------------- 1.6/8.1 MB 3.7 MB/s eta 0:00:02
   ----------- ---------------------------- 2.4/8.1 MB 3.6 MB/s eta 0:00:02
   --------------- ------------------------ 3.1/8.1 MB 3.7 MB/s eta 0:00:02
   -------------------- ------------------- 4.2/8.1 MB 3.9 MB/s eta 0:00:02
   ------------------------ --------------- 5.0/8.1 MB 3.8 MB/s eta 0:00:01
   ----------------------------- ---------- 6.0/8.1 MB 3.9 MB/s eta 0:00:01
   --------------------------------- ------ 6.8/8.1 MB 3.9 MB/s eta 0:00:01
   -------------------------------------- - 7.9/8.1 MB 4.0 MB/s eta 0:00:01
   ---------------------------------------- 8.1/8.1 MB 3.8 MB/s eta 0:00:00
Downloading contourpy-1.3.3-cp313-cp313-win_amd64.whl (226 kB)
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.59.1-cp313-cp313-win_amd64.whl (2.3 MB)
   ---------------------------------------- 0.0/2.3 MB ? eta -:--:--
   ------------- -------------------------- 0.8/2.3 MB 3.6 MB/s eta 0:00:01
   --------------------------- ------------ 1.6/2.3 MB 3.8 MB/s eta 0:00:01
   ---------------------------------------- 2.3/2.3 MB 3.6 MB/s eta 0:00:00
Downloading kiwisolver-1.4.9-cp313-cp313-win_amd64.whl (73 kB)
Downloading pillow-11.3.0-cp313-cp313-win_amd64.whl (7.0 MB)
   ---------------------------------------- 0.0/7.0 MB ? eta -:--:--
   ---- ----------------------------------- 0.8/7.0 MB 4.0 MB/s eta 0:00:02
   ---------- ----------------------------- 1.8/7.0 MB 3.9 MB/s eta 0:00:02
   --------------- ------------------------ 2.6/7.0 MB 4.0 MB/s eta 0:00:02
   --------------------- ------------------ 3.7/7.0 MB 4.3 MB/s eta 0:00:01
   ---------------------------- ----------- 5.0/7.0 MB 4.6 MB/s eta 0:00:01
   ---------------------------------- ----- 6.0/7.0 MB 4.7 MB/s eta 0:00:01
   ---------------------------------------  6.8/7.0 MB 4.6 MB/s eta 0:00:01
   ---------------------------------------- 7.0/7.0 MB 4.5 MB/s eta 0:00:00
Downloading pyparsing-3.2.3-py3-none-any.whl (111 kB)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib

   ---------------------------------------- 0/7 [pyparsing]
   ---------------------------------------- 0/7 [pyparsing]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------------- 7/7 [matplotlib]

Successfully installed contourpy-1.3.3 cycler-0.12.1 fonttools-4.59.1 kiwisolver-1.4.9 matplotlib-3.10.5 pillow-11.3.0 pyparsing-3.2.3

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip